{
  "backend/main.mo": "Empty Motoko actor file serving as the backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting removal of VideoEmbed components from 'Learn More' sections across seven pages (Overview, SolarHeating, SolarCells, Hydropower, WindPower, Geothermal, Biomass) with associated test IDs REQ-21 through REQ-26.",
  "frontend-file-summaries.txt": "JSON summary of six frontend files describing educational pages for Biomass, Biofuels, Contact form, Quiz component with TypeScript fixes, and global CSS with OKLCH color system.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, including eco-friendly chart colors and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Renewable Energy Educational Website.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with 10 routes (Overview, SolarHeating, SolarCells, Hydropower, WindPower, Geothermal, Biomass, Biofuels, Contact, Quiz) and ThemeProvider wrapper.",
  "frontend/src/components/faq/FAQSection.tsx": "FAQ accordion component with eight questions about renewable energy covering efficiency, costs, climate impact, and home usage.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with brand section, quick links navigation, newsletter subscription form, social media links, and references to external resources.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, desktop/mobile navigation for 10 pages, theme toggle button, and mobile sheet menu.",
  "frontend/src/components/layout/Layout.tsx": "Layout wrapper component combining Header, Footer, main content area, and Toaster for notifications.",
  "frontend/src/components/overview/AnimatedStats.tsx": "Displays animated statistics about renewable energy (global share, jobs, cost reduction, investment) using intersection observer to trigger counter animations when visible.",
  "frontend/src/components/shared/FactBox.tsx": "Reusable card component that displays \"Did You Know?\" facts with an optional icon and styled with eco-green theme colors.",
  "frontend/src/components/shared/VideoEmbed.tsx": "Responsive video embed component supporting YouTube and Vimeo platforms with 16:9 aspect ratio.",
  "frontend/src/components/solar/PVDiagram.tsx": "Animated diagram illustrating photovoltaic solar cell operation, showing sunlight conversion to DC electricity through N-type and P-type semiconductor layers.",
  "frontend/src/components/wind/AnimatedTurbine.tsx": "Simple component displaying a continuously rotating wind turbine icon using CSS animation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, handling both authenticated and anonymous identities with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom eco-friendly color palette (green, blue, brown) and design tokens for light/dark themes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Biofuels.tsx": "Educational page about biofuels covering types (ethanol, biodiesel, advanced biofuels), characteristics, production methods, and sustainability considerations with cards and icons.",
  "frontend/src/pages/Biomass.tsx": "Displays comprehensive information about biomass energy, including sources (wood, agricultural materials, waste), conversion processes, advantages/disadvantages, and statistics in tables and cards.",
  "frontend/src/pages/Contact.tsx": "Provides a contact form with name, email, subject, and message fields, along with contact information cards displaying email, phone, and address details.",
  "frontend/src/pages/Geothermal.tsx": "Explains geothermal energy fundamentals, how geothermal power plants work with diagrams, different plant types, applications, and benefits/challenges of tapping Earth's internal heat.",
  "frontend/src/pages/Hydropower.tsx": "Details hydropower generation including how dams and turbines work, different types of hydropower facilities, advantages/disadvantages, and statistics presented in tables and diagrams.",
  "frontend/src/pages/Overview.tsx": "Serves as the main landing page with hero section, introduction to renewable energy, climate change importance, animated statistics, energy source comparisons, and FAQ section.",
  "frontend/src/pages/Quiz.tsx": "Interactive quiz component with 9+ questions about renewable energy topics (solar, wind, hydro, geothermal, biomass, biofuels), featuring progress tracking, answer validation, explanations, and score display with restart functionality.",
  "frontend/src/pages/SolarCells.tsx": "Educational page explaining solar cells and photovoltaics, covering the photoelectric effect, how PV cells work, semiconductor materials, efficiency metrics, and includes a PVDiagram component and data tables.",
  "frontend/src/pages/SolarHeating.tsx": "Educational page about solar thermal heating systems, explaining how they capture and transfer heat for water and space heating, including system diagrams and efficiency comparisons to photovoltaic systems.",
  "frontend/src/pages/WindPower.tsx": "Educational page about wind power generation, explaining how wind turbines convert kinetic energy to electricity, featuring an AnimatedTurbine component and covering turbine mechanics, energy conversion process, and scale information.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, eco-themed colors (eco-green, eco-blue, earth-brown), custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking an educational renewable energy website with 8 main sections, responsive design, dark mode, and interactive features. Contains architectural notes, existing features list with 14 implemented features covering navigation, styling, content pages (solar, hydropower, wind, geothermal, biomass, biofuels), quiz, FAQ, contact form, and PDF generation."
}